# Day 26 - Pandas

In [1]:
import pandas as pd
import numpy as np

### 1. The following DataFrames are given. Notice that we have a duplicate row in the employees DataFrame. Remove the duplicate from the employees DataFrame and assign them to the employees_unique variable. Then use the pd.merge() function to make an INNER join of employees_unique and departments DataFrames based on the dept_id column.

In response, print the result to the console.

In [2]:
employees = pd.DataFrame({
    'emp_id': ['1001', '1002', '1003', '1003', '1004'],
    'first_name': ['John', 'Mark', 'Bob', 'Bob', 'Alice'],
    'last_name': ['Smith', 'Cook', 'Cat', 'Cat', 'Lee'],
    'dept_id': ['002', '001', '001', '001', '005']
})

departments = pd.DataFrame({
    'dept_id': ['001', '002', '003', '004'],
    'dept_name': ['IT', 'Sales', 'Marketing', 'Support']
})

# Start your code here
employees_unique = employees.drop_duplicates()
result = pd.merge(
    employees_unique, 
    departments, 
    how='inner', 
    on='dept_id'
)
print(result)

  emp_id first_name last_name dept_id dept_name
0   1001       John     Smith     002     Sales
1   1002       Mark      Cook     001        IT
2   1003        Bob       Cat     001        IT

---

### 2. The following `tips` DataFrame is given. Average value of the tip and total_bill columns broken down into days.

In response, print result to the console.



Tip: Use the pd.pivot_table() function.

In [3]:
tips = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv')
result = pd.pivot_table(
    tips, 
    index='day', 
    values=['tip', 'total_bill'], 
    aggfunc='mean'
)
print(result)

           tip  total_bill
day
Fri   2.734737   17.151579
Sat   2.993103   20.441379
Sun   3.255132   21.410000
Thur  2.771452   17.682742

---

### 3. The following `tips` DataFrame is given. Average value of the tip and total_bill columns broken down into days and gender.

In response, print result to the console.



Tip: Use the pd.pivot_table() function.

In [4]:
result = pd.pivot_table(
    tips, 
    index=['day', 'sex'], 
    values=['tip', 'total_bill'], 
    aggfunc='mean'
)
print(result)

                  tip  total_bill
day  sex
Fri  Female  2.781111   14.145556
     Male    2.693000   19.857000
Sat  Female  2.801786   19.680357
     Male    3.083898   20.802542
Sun  Female  3.367222   19.872222
     Male    3.220345   21.887241
Thur Female  2.575625   16.715312
     Male    2.980333   18.714667

---

### 4. The following `tips` DataFrame is given. Maximum value of the tip and total_bill columns broken down into days.

In response, print result to the console.



Tip: Use the pd.pivot_table() function.

In [5]:
result = pd.pivot_table(
    tips, 
    index='day', 
    values=['tip', 'total_bill'], 
    aggfunc='max'
)
print(result)

        tip  total_bill
day
Fri    4.73       40.17
Sat   10.00       50.81
Sun    6.50       48.17
Thur   6.70       43.11

---

### 5. The following `tips` DataFrame is given. Average value of the tip and total_bill columns broken down into days, gender and smoker / non-smoker.

In response, print result to the console.



Tip: Use the pd.pivot_table() function.

In [6]:
result = pd.pivot_table(
    tips, 
    index=['day', 'sex', 'smoker'], 
    values=['tip', 'total_bill'], 
    aggfunc='mean'
)
print(result)

                         tip  total_bill
day  sex    smoker
Fri  Female No      3.125000   19.365000
            Yes     2.682857   12.654286
     Male   No      2.500000   17.475000
            Yes     2.741250   20.452500
Sat  Female No      2.724615   19.003846
            Yes     2.868667   20.266667
     Male   No      3.256563   19.929063
            Yes     2.879259   21.837778
Sun  Female No      3.329286   20.824286
            Yes     3.500000   16.540000
     Male   No      3.115349   20.403256
            Yes     3.521333   26.141333
Thur Female No      2.459600   16.014400
            Yes     2.990000   19.218571
     Male   No      2.941500   18.486500
            Yes     3.058000   19.171000

---

### 6. The following `result` DataFrame is given. Extract values for Sunday from this DataFrame and print it to the console.

In [9]:
result.loc['Sun']

                    tip  total_bill
sex    smoker
Female No      3.329286   20.824286
       Yes     3.500000   16.540000
Male   No      3.115349   20.403256
       Yes     3.521333   26.141333

---

### 7. The following `tips` DataFrame is given. Extract values for Sunday and men from this DataFrame and print it to the console.

In [11]:
result.loc['Sun'].loc['Male']

             tip  total_bill
smoker
No      3.115349   20.403256
Yes     3.521333   26.141333

## Congratulate, Day 26 Finished!